src/cf/InformationRegisters/ор_ФальсификатыЛекарственныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ор_ФальсификатыЛекарственныхСредств</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фальсифицирован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НаименованиеПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПисьма</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаименованиеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ор_ФальсификатыЛекарственныхСредств/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Подключается и получает данные о фальсификатах с сайта roszdravnadzor.
//
// Параметры:
//   Параметры	- Структура - параметры метода.
//	 АдресРезультата	- Строка - адрес результата.
//
Процедура ПолучитьДанныеССайтаРосздравназдзор(Параметры, АдресРезультата, АдресХраненияФайла) Экспорт
	
	ПараметрыЗагрузкиФайла = Новый Структура;
	ПараметрыЗагрузкиФайла.Вставить("ПутьДляСохранения", ПолучитьИмяВременногоФайла());
	ПараметрыЗагрузкиФайла.Вставить("Таймаут", 43200);
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type","application/x-www-form-urlencoded");
	ПараметрыЗагрузкиФайла.Вставить("Заголовки", Заголовки);
	
	URLСтрока = "http://roszdravnadzor.ru/ajax/services/lssearch";
	
	СтрокаПараметры = "";
	Для Каждого ПараметрЗапроса Из Параметры Цикл
		СтрокаПараметры = СтрокаПараметры + 
			СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				"%1=%2&",
				ПараметрЗапроса.Ключ,
				КодироватьСтроку(ПараметрЗапроса.Значение,СпособКодированияСтроки.КодировкаURL));
	КонецЦикла;
	
	СтрокаПараметры = Лев(СтрокаПараметры, СтрДлина(СтрокаПараметры) - 1);
	СтрокаПараметры = СтрокаПараметры + "&order[0][column]=0&order[0][dir]=asc";
	
	URLСтрока = URLСтрока + "?" + СтрокаПараметры;
	
	Результат = ПолучитьДанныеСервиса(URLСтрока, ПараметрыЗагрузкиФайла);
	
	РезультатВыполнения = Новый Структура("Статус, КодСостояния, СообщениеОбОшибке, МассивДанных");
	РезультатВыполнения.Вставить("МассивДанных", Новый Массив);
	
	Если Результат.Статус = "Ошибка" Тогда
		ЗаполнитьЗначенияСвойств(РезультатВыполнения, Результат);
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	ОписаниеТипа = Новый ОписаниеТипов("Число");
	КоличествоПозиций = ОписаниеТипа.ПривестиЗначение(Результат.Данные.recordsTotal);
	
	Если КоличествоПозиций = Неопределено ИЛИ КоличествоПозиций = 0 Тогда
		
		РезультатВыполнения.КодСостояния = Результат.КодСостояния;;
		РезультатВыполнения.Статус = "Ошибка";
		РезультатВыполнения.СообщениеОбОшибке = НСтр("ru='В сервисе нет данных по параметрам текущего запроса.'");
		
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	КоличествоИтераций = Цел(КоличествоПозиций / Параметры.length) + ?(КоличествоПозиций % Параметры.length <> 0, 0, 1);
	
	МассивJSON = Результат.Данные.data;
	Для Счетчик = 1 По КоличествоИтераций Цикл
		
		// URL уже содержит параметры.
		URLСтрока = URLСтрока + "&start=" + Формат(Параметры.length * Счетчик, "ЧРГ=");
		
		Результат = ПолучитьДанныеСервиса(URLСтрока, ПараметрыЗагрузкиФайла);
		
		Если Результат.Статус = "Ошибка" Тогда
			ЗаполнитьЗначенияСвойств(РезультатВыполнения, Результат);
			ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
			Возврат;
		КонецЕсли;
		
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивJSON, Результат.Данные.data);
	КонецЦикла;
	
	РезультатВыполнения.Статус = "Выполнено";
	РезультатВыполнения.МассивДанных = МассивJSON;
	
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресРезультата);
	
КонецПроцедуры

// Процедура сохраняет данные загруженного файла забракованных серий с Росздравназдзора
// и помещает результат во временное хранилище.
//
// Параметры:
//  Параметры				- Структура - параметры метода.
//  АдресРезультатаЗагрузки	- Строка - адрес результата.
//
Процедура ЗагрузитьЗабракованныеСерииРосздравнадзор(Параметры, АдресРезультатаЗагрузки) Экспорт
	
	МассивДанных = Параметры.МассивДанных;
	Если ТипЗнч(МассивДанных) <> Тип("Массив") Или МассивДанных.Количество() = 0 Тогда
		ПоместитьВоВременноеХранилище(0, АдресРезультатаЗагрузки);
		Возврат;
	КонецЕсли;
	
	МетаданныеРегистра = Метаданные.РегистрыСведений.ор_ФальсификатыЛекарственныхСредств;
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Серия"                    , МетаданныеРегистра.Измерения.Серия.Тип);
	Таблица.Колонки.Добавить("НаименованиеНоменклатуры" , МетаданныеРегистра.Измерения.НаименованиеНоменклатуры.Тип);
	Таблица.Колонки.Добавить("НаименованиеПроизводителя", МетаданныеРегистра.Реквизиты.НаименованиеПроизводителя.Тип);
	Таблица.Колонки.Добавить("НомерПисьма"              , МетаданныеРегистра.Реквизиты.НомерПисьма.Тип);
	Таблица.Колонки.Добавить("ДатаПисьма"               , МетаданныеРегистра.Реквизиты.ДатаПисьма.Тип);
	Таблица.Колонки.Добавить("Фальсифицирован"          , МетаданныеРегистра.Ресурсы.Фальсифицирован.Тип);
	Таблица.Колонки.Добавить("ХешЗаписи"                , МетаданныеРегистра.Реквизиты.ХешЗаписи.Тип);
	
	Для Каждого ДанныеJSON Из МассивДанных Цикл
		НоваяСтрока = Таблица.Добавить();
		
		НоваяСтрока.НаименованиеНоменклатуры = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1 %2",
			СокрЛП(ДанныеJSON.col1.label),
			СокрЛП(ДанныеJSON.col2[?(ДанныеJSON.col2.Свойство("title"), "title", "label")]));
		
		НоваяСтрока.Серия = СокрЛП(ДанныеJSON.col3.label);
		НоваяСтрока.НаименованиеПроизводителя = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			"%1 (%2)",
			СокрЛП(ДанныеJSON.col4[?(ДанныеJSON.col4.Свойство("title"), "title", "label")]),
			СокрЛП(ДанныеJSON.col5.label));
		
		Массив = СтрРазделить(ДанныеJSON.col10.title, " ");
		Если Массив.Количество() > 3 Тогда
			НоваяСтрока.НомерПисьма = СокрЛП(Массив[1]);
			НоваяСтрока.ДатаПисьма = РаботаСНоменклатуройУНФ.ПреобразоватьСтрокуВДату(СокрЛП(Массив[3]));
		КонецЕсли;
		
		Если ДанныеJSON.col8.label = Неопределено Тогда
			НоваяСтрока.Фальсифицирован = СтрНайти(ВРег(СокрЛП(ДанныеJSON.col7.label)), "РАЗРЕШЕНИЕ") = 0;
		Иначе
			НоваяСтрока.Фальсифицирован = Истина;
		КонецЕсли;
		
		НоваяСтрока.ХешЗаписи = ХешЗаписи(НоваяСтрока);
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Таблица", Таблица);
	
	Запрос.Текст = "ВЫБРАТЬ
	|	Таблица.Серия КАК Серия,
	|	Таблица.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	Таблица.НаименованиеПроизводителя КАК НаименованиеПроизводителя,
	|	Таблица.НомерПисьма КАК НомерПисьма,
	|	Таблица.ДатаПисьма КАК ДатаПисьма,
	|	Таблица.Фальсифицирован КАК Фальсифицирован,
	|	Таблица.ХешЗаписи КАК ХешЗаписи
	|ПОМЕСТИТЬ ТаблицаЗабраковок
	|ИЗ
	|	&Таблица КАК Таблица
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Серия,
	|	НаименованиеНоменклатуры,
	|	ХешЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗабраковок.Серия КАК Серия,
	|	ТаблицаЗабраковок.НаименованиеНоменклатуры КАК НаименованиеНоменклатуры,
	|	ТаблицаЗабраковок.НаименованиеПроизводителя КАК НаименованиеПроизводителя,
	|	ТаблицаЗабраковок.НомерПисьма КАК НомерПисьма,
	|	ТаблицаЗабраковок.ДатаПисьма КАК ДатаПисьма,
	|	ТаблицаЗабраковок.Фальсифицирован КАК Фальсифицирован,
	|	ТаблицаЗабраковок.ХешЗаписи КАК ХешЗаписи,
	|	ЕСТЬNULL(ор_ФальсификатыЛекарственныхСредств.Серия, """") КАК СерияРегистр
	|ИЗ
	|	ТаблицаЗабраковок КАК ТаблицаЗабраковок
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ор_ФальсификатыЛекарственныхСредств КАК ор_ФальсификатыЛекарственныхСредств
	|		ПО ТаблицаЗабраковок.Серия = ор_ФальсификатыЛекарственныхСредств.Серия
	|			И ТаблицаЗабраковок.НаименованиеНоменклатуры = ор_ФальсификатыЛекарственныхСредств.НаименованиеНоменклатуры
	|			И ТаблицаЗабраковок.ХешЗаписи = ор_ФальсификатыЛекарственныхСредств.ХешЗаписи
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаПисьма УБЫВ
	|ИТОГИ ПО
	|	НаименованиеНоменклатуры,
	|	Серия";
	Количество = 0;
	
	ВыборкаНомерРЛС = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "НаименованиеНоменклатуры");
	Пока ВыборкаНомерРЛС.Следующий() Цикл
		ВыборкаСерия = ВыборкаНомерРЛС.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Серия");
		Пока ВыборкаСерия.Следующий() Цикл
			
			Если ПустаяСтрока(ВыборкаСерия.Серия) Тогда
				Продолжить;
			КонецЕсли;
			
			Выборка = ВыборкаСерия.Выбрать();
			Выборка.Следующий();
			
			Если НЕ ПустаяСтрока(Выборка.СерияРегистр) Тогда 
				Продолжить;
			КонецЕсли;
			
			Если ПустаяСтрока(Выборка.НаименованиеНоменклатуры) Тогда
				Продолжить;
			КонецЕсли;
			
			МенеджерЗаписи = РегистрыСведений.ор_ФальсификатыЛекарственныхСредств.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(МенеджерЗаписи, Выборка);
			
			МенеджерЗаписи.Записать();
			
			Количество = Количество + 1;
		КонецЦикла;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(Количество, АдресРезультатаЗагрузки);
	
КонецПроцедуры

Функция ХешЗаписи(Запись) Экспорт
	
	Массив = Новый Массив;
	Массив.Добавить(Запись.Серия);
	Массив.Добавить(Запись.НаименованиеНоменклатуры);
	Массив.Добавить(Запись.Фальсифицирован);
	Массив.Добавить(Запись.НаименованиеПроизводителя);
	Массив.Добавить(Запись.НомерПисьма);
	Массив.Добавить(Запись.ДатаПисьма);
	
	ХешированиеДанных = Новый ХешированиеДанных(ХешФункция.MD5);
	ХешированиеДанных.Добавить(СтрСоединить(Массив, ";"));
	
	Возврат СтрЗаменить(Строка(ХешированиеДанных.ХешСумма), " ", "");
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьДанныеСервиса(URLСтрока, ПараметрыЗагрузкиФайла)
	
	ПутьКДанным = ПараметрыЗагрузкиФайла.ПутьДляСохранения;
	
	Результат = ПолучениеФайловИзИнтернета.СкачатьФайлНаСервере(URLСтрока, ПараметрыЗагрузкиФайла);
	
	РезультатВыполнения = Новый Структура("Статус, КодСостояния, СообщениеОбОшибке");
	
	Если Не Результат.Статус Тогда
		Результат.Статус = "Ошибка";
		
		ЗаполнитьЗначенияСвойств(РезультатВыполнения, Результат);
		
		УдалитьФайлы(ПутьКДанным);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьФайл(ПутьКДанным);
	
	Попытка
		РезультатJSON = ПрочитатьJSON(ЧтениеJSON, Ложь);
	Исключение
		Результат.Статус = "Ошибка";
		Результат.Вставить("СообщениеОбОшибке", НСтр("ru='Невозможно разобрать ответ сервиса.'"));
		
		ЗаполнитьЗначенияСвойств(РезультатВыполнения, Результат);
		
		УдалитьФайлы(ПутьКДанным);
		Возврат РезультатВыполнения;
	КонецПопытки;
	
	ЧтениеJSON.Закрыть();
	УдалитьФайлы(ПутьКДанным);
	
	РезультатВыполнения.Вставить("Данные", РезультатJSON);
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти

#КонецЕсли
